driver-tests/bpelse/correlation/correlationJBI/test/invoke2Correlation/Input2.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:xsi="http://www.w3.org/1999/XMLSchema-instance"
                   xmlns:xsd="http://www.w3.org/1999/XMLSchema"
                   xmlns:tns="http://seebeyond.com/correlation/"
                   xmlns="invoke2parent">
 <SOAP-ENV:Header/>
 <SOAP-ENV:Body>
 <invoke2parentOperation1>
       <invoke2parentElement>
          <string>1.11</string>
       </invoke2parentElement>
 </invoke2parentOperation1>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>